In [1]:
# Import the necessary libraries

import sqlite3 as sqlite

import pandas as pd

from sqlalchemy import create_engine

In [3]:
# Create a population database and inserting a table using sqlite

with sqlite.connect('population.db') as con:
    cur = con.cursor()
    cur.execute("CREATE TABLE IF NOT EXISTS Population(id INTEGER PRIMARY KEY, country TEXT, population INT)")
    cur.execute("INSERT INTO Population VALUES(NULL, 'Germany', 81197537)")
    cur.execute("INSERT INTO Population VALUES(NULL, 'France', 66415161)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Italy', 60795612)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain',46439864)")

## Creating Connection with SQLAlchemy

In [4]:
connection = create_engine('sqlite:///population.db')

## Reading SQL data with Pandas

In [ ]:
# create SQL query
sql = 'SELECT * FROM Population'
#read SQL query
df = pd.read_sql_query(sql, connection)
#Ouput query results
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

In [6]:
# table name
table = 'Population'

df = pd.read_sql_table(table, connection)

df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

In [7]:
#read_sql() can do both of the above depending on what is written in the first argument
sql = 'SELECT * FROM Population'

df = pd.read_sql(sql,connection)

df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

In [8]:
table = 'Population'

df = pd.read_sql(table, connection)

df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

## Closing the Connection

In [11]:
# always important to close the connection when you're done working with the database
connection.close()

AttributeError: 'Engine' object has no attribute 'close'